// pages/user-problem/user-problem.js
Page({

  /**
   * 页面的初始数据
   */
  
  data: {
    problem:[
      { tit: "1.红包游戏怎么玩？", text:"你可以设置一个带奖励的游戏红包，好友根据抛出冰壶的距离远近来领不同金额的红包，夺得第一名者可领取总金额30%，剩余参与者领取红包总金额70%。"},
      { tit: "2.我支付了但没有发出去？", text: "请在主页的（我的记录）中找到相应的记录，点击进入详情后点击（去转发）可以把红包转发给好友或者好友群，你也可以生成朋友圈分享图在转发也可以。" },
      { tit: "3.好友可以转发游戏红包吗？", text: "可以的，您可以分享给好友或者转发给好友或者转发到微信群的游戏红包，其他好友均可以再次转发。" },
      { tit: "4.游戏红包收手续费吗？", text: "发游戏红包回收1%的技术服务费。" },
      { tit: "5.未领取的金额会怎么样处理？", text: "未领取的红包会在24小时退回到小程序钱包里，同时，未领取金额的服务费也将全部退回。" },
      { tit: "6.如何提现到微信钱包？", text: "在主页（余额体现）或者详情页的（去提现）均可跳转至余额提现页面进行提现，提现金额每次至少1元，每天最多提现3次"},
      { tit: "7.提现会收手续费吗？多久到账？", text: "提现不收服务费：申请提现后会在1-5个工作日内转到你的微信红包。" },
      { tit: "8.如何联系客服？(客服在线时间9：30-23:00）", text: "请拨打我们的客服热线电话：010-64705030" },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})